[
  {
    "name": "Hydrogen",
    "abbrv": "H",
    "protons": 1,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "With an atomic weight of about one atomic mass unit, hydrogen is the lightest element on the periodic table. It is the most abundant chemical substance in the universe, making up about 75% of all mass."
  },
  {
    "name": "Helium",
    "abbrv": "He",
    "protons": 2,
    "group": "noble-gas",
    "display-group": "noble gas",
    "desc": "Helium is a colorless, odorless, tasteless gas. Its boiling and melting points are the lowest among all the elements."
  },
  {
    "name": "Lithium",
    "abbrv": "Li",
    "protons": 3,
    "group": "alkali-metal",
    "display-group": "alkali metal",
    "desc": "Lithium is a soft, silver metal. Under standard conditions, it is the lightest metal and the least dense solid element."
  },
  {
    "name": "Beryllium",
    "abbrv": "Be",
    "protons": 4,
    "group": "alkaline-earth-metal",
    "display-group": "alkaline earth metal",
    "desc": "Beryllium is a relatively rare universal element. It occurs naturally only in combination with other elements in minerals and crystals, like emerald and aquamarine. It is used frequently in copper and nickel alloys."
  },
  {
    "name": "Boron",
    "abbrv": "B",
    "protons": 5,
    "group": "metalloid",
    "display-group": "metalloid",
    "desc": "Boron is a dark, powder-like low-abundance element in both the Solar system and the Earth's crust produced more often from cosmic rays and supernovae. Boron is concentrated on Earth by many water-soluble minerals and can be used to make bleach and other preservatives."
  },
  {
    "name": "Carbon",
    "abbrv": "C",
    "protons": 6,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "Carbon is a nonmetallic element with four electrons available to form many chemical bonds. Carbon is highly abundant in living organisms and is one of the most abudant chemicals on Earth."
  },
  {
    "name": "Nitrogen",
    "abbrv": "N",
    "protons": 7,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "Nitrogen is a transparent, odorless gas at room temperature. Nitrogen is a common element in the universe, making up about a seventh of elemental abundance in the Milky Way and the Solar System."
  },
  {
    "name": "Oxygen",
    "abbrv": "O",
    "protons": 8,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "Oxygen is a highly reactive gaseous nonmetal and oxidizing agent that readily forms compounds (notably oxides) with most elements. By mass, oxygen is the third-most abundant element in the universe, after hydrogen and helium."
  },
  {
    "name": "Fluorine",
    "abbrv": "F",
    "protons": 9,
    "group": "halogen",
    "display-group": "halogen",
    "desc": "Fluorine is the lightest halogen and exists as a toxic pale yellow gas at standard conditions. It is extremely reactive: almost all other elements, including some noble gases, form compounds with fluorine."
  },
  {
    "name": "Neon",
    "abbrv": "Ne",
    "protons": 10,
    "group": "noble-gas",
    "display-group": "noble gas",
    "desc": "Neon is a colorless, odorless gas under standard conditions, with about two-thirds the density of air. It is often used in bright lighting and computerized displays."
  },
  {
    "name": "Sodium",
    "abbrv": "Na",
    "protons": 11,
    "group": "alkali-metal",
    "display-group": "alkali metal",
    "desc": "Sodium is a soft, silver-white, highly reactive metal. Sodium is half of the common kitchen compound, table salt, and is also used in nuclear reactors and many chemical factories."
  },
  {
    "name": "Magnesium",
    "abbrv": "Mg",
    "protons": 12,
    "group": "alkaline-earth-metal",
    "display-group": "alkaline earth metal",
    "desc": "Magnesium is a shiny gray solid under standard conditions. Magnesium is the ninth most abundant element in the universe. It is very lightweight and easily burns brightly in contact with air. "
  },
  {
    "name": "Aluminium",
    "abbrv": "Al",
    "protons": 13,
    "group": "basic-metal",
    "display-group": "basic metal",
    "desc": "Aluminium is a silvery-white, soft, nonmagnetic metal. Aluminium is the third most abundant element (after oxygen and silicon), and the most abundant metal, in the Earth's crust."
  },
  {
    "name": "Silicon",
    "abbrv": "Si",
    "protons": 14,
    "group": "metalloid",
    "display-group": "metalloid",
    "desc": "Silicon is a stable metalloid. Controversy about silicon's character dates to its discovery. Silicon is very often used in computer technology, particularly components called semiconductors which allow computers to store and manipulate memory."
  },
  {
    "name": "Phosphorus",
    "abbrv": "P",
    "protons": 15,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "As an element, phosphorus exists in two major forms: white phosphorus and red phosphorus. Due to its high reactivity, phosphorus is never found as a free element on Earth. Instead phosphorus-containing minerals are commonly present in inorganic phosphate rocks."
  },
  {
    "name": "Sulfur",
    "abbrv": "S",
    "protons": 16,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "Sulfur is an abundant nonmetal. Under normal conditions, sulfur can form complex molecules with other reactive gases and are commonly found distributed in various minerals."
  },
  {
    "name": "Chlorine",
    "abbrv": "Cl",
    "protons": 17,
    "group": "halogen",
    "display-group": "halogen",
    "desc": "Chlorine is a yellow-green gaseous halogen. Chlorine is the second lightest halogen following fluorine and is highly toxic in its common gaseous form."
  },
  {
    "name": "Argon",
    "abbrv": "Ar",
    "protons": 18,
    "group": "noble-gas",
    "display-group": "noble gas",
    "desc": "Argon is a colorless, odorless, inert gas. Argon is the third most common gas in the Earth's atmosphere, making it over twice as abundant as the next most common atmospheric gas, water vapor, and 23 times as abundant as the next most common atmospheric gas, carbon dioxide, and more than 500 times as abundant as the next most common noble gas, neon."
  },
  {
    "name": "Potassium",
    "abbrv": "K",
    "protons": 19,
    "group": "alkali-metal",
    "display-group": "alkali metal",
    "desc": "Potassium is a soft, silvery metal that's highly reactive with air. Potassium was first isolated from potash, the ashes of plants, from which its name is derived."
  },
  {
    "name": "Calcium",
    "abbrv": "Ca",
    "protons": 20,
    "group": "alkaline-earth-metal",
    "display-group": "alkaline earth metal",
    "desc": "Calcium is a soft gray alkaline earth metal and the fifth-most-abundant element by mass in the Earth's crust. Ionic calcium is also the fifth-most-abundant dissolved ion in seawater by both molarity and mass, after sodium, chloride, and magnesium."
  },
  {
    "name": "Scandium",
    "abbrv": "Sc",
    "protons": 21,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Scandium is a silvery-white metallic element. It has historically been sometimes classified as a rare earth element, together with yttrium and the lanthanides. It was discovered in 1879 in the minerals euxenite and gadolinite from Scandinavia."
  },
  {
    "name": "Titanium",
    "abbrv": "Ti",
    "protons": 22,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Titanium is a transition metal with a silver color, low density and high strength. It is highly resistant to corrosion in sea water and chlorine. Titanium is commonly used in the material design and manufacturing of aircraft, spacecraft, and missiles."
  },
  {
    "name": "Vanadium",
    "abbrv": "V",
    "protons": 23,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Vanadium is a hard, silvery grey, malleable transition metal. Vanadium is resistent against corrosion and is commonly used in steel structures like armor and mechanical cranks."
  },
  {
    "name": "Chromium",
    "abbrv": "Cr",
    "protons": 24,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Chromium is a steely-gray, lustrous, hard and brittle metal which takes a high polish, resists tarnishing, and has a high melting point. Due to its remarkable material properties, it is commonly used to strengthen steel alloys and can be used as a polish and finish for many materials to give it that nice 'chrome' look."
  },
  {
    "name": "Manganese",
    "abbrv": "Mn",
    "protons": 25,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Manganese is not found as a free element in nature; it is often found in combination with iron, and in many minerals. Manganese is a metal with important industrial metal alloy uses, particularly in stainless steels."
  },
  {
    "name": "Iron",
    "abbrv": "Fe",
    "protons": 26,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Iron is by mass the most common element on Earth, forming much of Earth's outer and inner core. Iron is a shiny, greyish metal that rusts in damp air. Most iron is used to manufacture steel, used in civil engineering (reinforced concrete, girders etc) and in manufacturing."
  },
  {
    "name": "Cobalt",
    "abbrv": "Co",
    "protons": 27,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Cobalt in the Earth's crust is found only in chemically combined form. The free element, produced by reductive smelting, is a hard, lustrous, silver-gray metal."
  },
  {
    "name": "Nickel",
    "abbrv": "Ni",
    "protons": 28,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Nickel is a silvery-white lustrous metal with a slight golden tinge. Nickel belongs to the transition metals and is hard and ductile."
  },
  {
    "name": "Copper",
    "abbrv": "Cu",
    "protons": 29,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Copper is a soft, malleable and ductile metal with very high thermal and electrical conductivity. A freshly exposed surface of pure copper has a reddish-orange color."
  },
  {
    "name": "Zinc",
    "abbrv": "Zn",
    "protons": 30,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "Identified as an element in 1746, but known to the Greeks and Romans before 20BC. The name is derived from the German, 'zinc', which may in turn be derived from the Persian word 'sing', meaning stone."
  },
  {
    "name": "Gallium",
    "abbrv": "Ga",
    "protons": 31,
    "group": "basic-metal",
    "display-group": "basic metal",
    "desc": "Elemental gallium does not occur in free form in nature. Gallium is a soft, silvery metal, and elemental gallium is a brittle solid at low temperatures, and melts at slightly above room temperature."
  },
  {
    "name": "Germanium",
    "abbrv": "Ge",
    "protons": 32,
    "group": "metalloid",
    "display-group": "metalloid",
    "desc": "Germanium is a lustrous, hard, grayish-white metalloid in the carbon group, chemically similar to its group neighbors tin and silicon. Purified germanium is a semiconductor, with an appearance most similar to elemental silicon."
  },
  {
    "name": "Arsenic",
    "abbrv": "As",
    "protons": 33,
    "group": "metalloid",
    "display-group": "metalloid",
    "desc": "Arsenic occurs in many minerals, usually in conjunction with sulfur and metals, and also as a pure elemental crystal."
  },
  {
    "name": "Selenium",
    "abbrv": "Se",
    "protons": 34,
    "group": "nonmetal",
    "display-group": "nonmetal",
    "desc": "It is a nonmetal with properties that are intermediate between those of its periodic table column-adjacent chalcogen elements sulfur and tellurium. It rarely occurs in its elemental state in nature, or as pure ore compounds."
  },
  {
    "name": "Bromine",
    "abbrv": "Br",
    "protons": 35,
    "group": "halogen",
    "display-group": "halogen",
    "desc": "Bromine (from Ancient Greek: meaning \"stench\"). The element was isolated independently by two chemists, Carl Jacob Löwig and Antoine Jerome Balard, in 1825–1826."
  },
  {
    "name": "Krypton",
    "abbrv": "Kr",
    "protons": 36,
    "group": "noble-gas",
    "display-group": "noble gas",
    "desc": "Krypton (from Greek: kryptos \"the hidden one\"). A colorless, odorless, tasteless noble gas, krypton occurs in trace amounts in the atmosphere, is isolated by fractionally distilling liquefied air, and is often used with other rare gases in fluorescent lamps."
  },
  {
    "name": "Rubidium",
    "abbrv": "Rb",
    "protons": 37,
    "group": "alkali-metal",
    "display-group": "alkali metal",
    "desc": "Rubidium is a soft, silvery-white metallic element of the alkali metal group. Elemental rubidium is highly reactive, with properties similar to those of other alkali metals, such as very rapid oxidation in air."
  },
  {
    "name": "Strontium",
    "abbrv": "Sr",
    "protons": 38,
    "group": "alkaline-earth-metal",
    "display-group": "alkaline earth metal",
    "desc": "An alkaline earth metal, strontium is a soft silver-white or yellowish metallic element that is highly reactive chemically. The metal turns yellow when it is exposed to air."
  },
  {
    "name": "Yttrium",
    "abbrv": "Y",
    "protons": 39,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "It is a silvery-metallic transition metal chemically similar to the lanthanides and it has often been classified as a \"rare earth element\". Yttrium is almost always found combined with the lanthanides in rare earth minerals and is never found in nature as a free element."
  },
  {
    "name": "Zirconium",
    "abbrv": "Zr",
    "protons": 40,
    "group": "transition-metal",
    "display-group": "transition metal",
    "desc": "The name of zirconium is taken from the name of the mineral zircon, the most important source of zirconium. The word zircon comes from the Persian word zargun, meaning \"gold-colored\"."
  }
]
